{
    "intro": {
        "header": {
            "type": "greeter",
            "text": "<span>{Hello!}</span><span>My name is jason</span>"
        },
        "descriptions": [
            "I'm a journalist/web developer/designer. I <del><a href='https://twitter.com/jasonleefrench'>tweet</a></del> <ins style='text-decoration: none;'><a href='https://bsky.app/profile/jasonleefren.ch'>bluesky</a></ins> classic Simpsons quotes and work as a graphics reporter at the <a href='https://www.wsj.com/'>Wall Street Journal</a>. I craft clean code to build <a href='https://www.jasonleefren.ch/projects'>interactive graphics</a> and tools.",
            "Telling stories is a blast!"
        ]
    },
    "projects": [
        {
            "title": "Who Owns SpongeBob? AI Shakes Hollywood’s Creative Foundation",
            "link": "https://www.wsj.com/articles/ai-chatgpt-hollywood-intellectual-property-spongebob-81fd5d15",
            "date": "April 2023",
            "description": {
                "text": [
                    "ChatGPT is already changing the world.",
                    "Hollywood wants to use generative technology to slash production costs and even create characters. But who (or what) owns the intellectual property of AI-derived works?",
                    "To give a taste of what ChatGPT can achieve, I built a tool that–based on characters and traits the reader chooses–generates a scene from a pilot TV show.",
                    "The results are sometimes cheesy, sometimes tearjearking and sometimes hilarious."
                ],
                "image": "/images/who-owns-spongebob-ai-shakes-hollywoods-creative-foundation.png"
            }
        },
        {
            "title": "How TikTok Serves Up Sex and Drug Videos to Minors",
            "link": "https://www.wsj.com/articles/tiktok-algorithm-sex-drugs-minors-11631052944",
            "date": "September 2021",
            "meta": [
                "🏆 Gerald Loeb Award",
                "🏆 Philip Meyer Journalism Award",
                "🥉 Society for News Design: Award of Excellence"
            ],
            "description": {
                "text": [
                    "Wall Street Journal reporters created dozens of automated accounts to dive deep into TikTok–one of the world's fastest-growing social media platforms.",
                    "Analysis of images and videos these bots collected found that TikTok's algorithms can quickly send young users down a well of sex and drug content.",
                    "I developed a series of graphics and charts that gave a taste of what the bots were exposed to, revealing to non-technical audiences the extreme content their children could be viewing."
                ],
                "image": "/images/how-tiktok-serves-up-sex-and-drug-videos-to-minors.png"
            }
        },
        {
            "title": "Amazon Routinely Hired Dangerous Trucking Companies, With Deadly Consequences",
            "link": "https://www.wsj.com/articles/amazon-trucks-crash-safety-11663793491",
            "date": "September 2022",
            "description": {
                "text": [
                    "The Wall Street Journal, examining more than 3,500 trucking companies, unearthed a startling fact: trucking contractors that worked frequently for Amazon were more than twice as likely as all other similar companies to receive bad unsafe driving scores.",
                    "I used WebGL to animate thousands of dots to represent the trucking companies, providing an in-depth and intuitive view of the data."
                ],
                "image": "/images/amazon-trucks-crash-safety.gif",
                "extraImageClasses": "gif"
            }
        },
        {
            "title": "Why Student Debt Keeps Growing—Even When Borrowers Keep Paying",
            "link": "https://www.wsj.com/articles/how-your-student-debt-keeps-growingeven-when-you-keep-paying-11640994313",
            "date": "December 2021",
            "description": {
                "text": [
                    "New data from the U.S. Education Department showed what many suspected: some college degrees just cannot pay off, and taxpayers foot the bill when borrowers can't pay down their loans.",
                    "In fact, graduates can diligently pay off loans and end up with more debt than when they started paying.",
                    "We used scrollytelling to keep the reader focused on one main visual that changed over time. This seemingly simple design of bar charts and animation makes an immediate and impactful statement of how crushing this debt can be for individuals."
                ],
                "video": "/videos/why-student-debt-keeps-growing-even-when-borrowers-keep-paying.webm"
            }
        },
        {
            "title": "Covid-19 Battle to Intensify as Winter Sets In",
            "link": "https://www.wsj.com/articles/covid-19-battle-to-intensify-as-winter-sets-in-11602840602",
            "date": "October 2020",
            "description": {
                "text": [
                    "Rising Covid-19 caseloads had public health authorities on high alert as the northern hemisphere headed into Winter 2020. One hopeful sign: the southern hemisphere experienced a mild flu season, easing seasonal pressure on hospitals.",
                    "To show the stark change in rates of flu, I designed and developed a series of animated maps. The maps are also scrubbable so readers can flick through the maps at their own pace."
                ],
                "image": "/images/covid-19-battle-to-intensify-as-winter-sets-in.png"
            }
        },
        {
            "title": "Europe Got Covid Largely Under Control in the Summer. What Went Wrong?",
            "link": "https://www.wsj.com/graphics/europe-covid-summer-what-went-wrong",
            "date": "November 2020",
            "description": {
                "text": [
                    "The second wave of the COVID crisis hit Europe harder than the first. Policymakers scrambled to keep the virus controlled until  vaccine rollout, as people returned to their day-to-day lives.",
                    "I built a side-by-side map view of Europe to illustrate how the virus took hold during the second wave, and an animated chart that showed the skyrocketing case numbers in the US and EU27 and U.K."
                ],
                "image": "/images/europe-covid-summer-what-went-wrong.png"
            }
        }
    ],
    "skills": [
        "I'm excellent at D3.js, React, jQuery, and the zen of vanilla JavaScript. I keep it functional and clean because code quality is 💯 on a deadline!",
        "I have a solid grounding in all aspects of front-end development and design. Along with my JavaScript expertise, I'm well-adept with Unix and using the command line and I'm great at Git too!",
        "I 💕 teaching others about what you can do with code. Helping out with colleagues' coding questions is the highlight of my job."
    ],
    "socials": [
        {
            "image": "/social/twitter.svg",
            "link": "https://twitter.com/jasonleefrench",
            "alt": "twitter"
        },
        {
            "image": "/social/github.svg",
            "link": "https://github.com/jasonleefrench",
            "alt": "github"
        },
        {
            "image": "/social/facebook.svg",
            "link": "https://facebook.com/jasonleefrench",
            "alt": "facebook"
        }
    ]
}
